Turn
so
the
scaffolding
is
on
your
left
and
go
with
flow
of
traffic
to
next
corner
turn
right
When
you
there
are
orange
cones
in
road
through
both
sides
Keep
going
first
intersection
but
at
second
one
a
large
red
brick
building
black
fence
Go
past
that
chain
link
thats
after
it
continue
flags
until
just
starting
front
On
two
trees
where
then
down
from
Touchdown
base
tree
about
halfway
street
Orient
yourself
facing
same
as
4
lane
Travel
this
Youll
see
white
awning
travel
parking
open
dumpster
The
has
blue
over
end
closest
top
You
will
start
out
by
Make
very
forward
pass
Then
wall
lot
colorful
graffiti
find
touchdown
doorway
yellow
moving
direction
straight
3
intersections
should
signs
for
store
well
Continue
stop
purple
Look
four
colored
each
side
door
bear
ground
center
Move
be
Stop
shortly
before
even
reach
crosswalk
There
arrow
sitting
point
position
following
glass
letter
if
theres
sign
van
parked
here
writing
behind
walkway
fire
hydrant
silver
part
rental
bikes
ways
an
As
move
up
Pass
construction
get
buildings
long
windows
tan
Begin
Walk
fourway
take
when
can
several
toward
columns
barriers
them
far
barrier
few
lights
pillars
sidewalk
have
bike
Align
subway
entrance
Head
make
around
curb
row
seat
way
playground
bus
another
green
back
pole
youll
other
still
mural
head
cross
Face
cars
3way
into
which
dead
awnings
truck
If
narrow
face
all
light
ahead
Right
now
garage
This
passing
After
It
above
against
Now
follow
At
block
Take
oneway
brown
delivery
approach
threeway
Proceed
gray
barrels
directly
rectangular
till
small
benches
trash
barrel
between
need
huge
park
Your
middle
Follow
hand
ends
half
some
pedestrian
basketball
courts
either
trim
distance
youre
Rotate
storefront
iron
short
school
many
towards
boxes
plants
arrows
In
1st
again
fencing
made
look
like
man
proceed
cone
line
With
poles
metal
American
last
flag
followed
under
To
lamp
post
pink
section
mailbox
standing
planters
its
ramp
planter
bit
opposite
square
potted
plant
walking
tall
A
gate
also
circle
Going
enter
away
Theres
bright
business
escape
looking
lots
fenced
off
canopy
bridge
crossing
turning
along
pipe
correct
window
come
please
banner
arched
gold
Please
Once
across
Stand
area
reaching
opening
turns
Before
doors
court
Hello
1
2
while
close
little
further
Good
luck
trashcan
painted
underneath
concrete
beige
letters
booth
keep
car
do
step
box
tunnel
Position
three
too
immediately
food
barricades
looks
only
median
Just
bottom
walk
set
dark
steps
hanging
inside
wheel
eye
bunch
slightly
veer
option
or
atop
orient
outside
almost
immediate
lettering
stand
stay
overpass
Youre
neon
below
restaurant
logo
symbol
smaller
water
heading
diamond
stopping
sure
coming
garbage
oncoming
more
once
bicycles
soon
want
making
near
umbrellas
cart
double
shop
round
flowers
keeping
bags
pile
mailboxes
path
Bear
From
stripes
third
wooden
Ignore
shaped
Ahead
entering
notice
bicycle
couple
exit
grey
those
striped
dont
vertical
text
stone
band
big
cap
Get
turned
Start
covering
newspaper
posts
nearest
time
billboard
onto
these
not
Enter
covered
walls
bench
bin
overhang
stairs
able
circular
hiding
arch
passed
arrive
air
stripe
final
place
bag
mail
stoplight
phone
no
ladder
church
people
floor
single
umbrella
empty
edge
youve
numbers
curve
GO
Step
tip
